In [65]:
import pandas as pd

In [66]:
df = pd.DataFrame({'A': [1, 2, 3, 3, 4], 'B': [3, 4, 2, 4, 5]})
df

   A  B
0  1  3
1  2  4
2  3  2
3  3  4
4  4  5

In [67]:
df.insert(loc=0, column='A', value=[5, 6, 2, 3, 4], allow_duplicates=True)
df

   A  A  B
0  5  1  3
1  6  2  4
2  2  3  2
3  3  3  4
4  4  4  5

In [68]:
loc=int(df.columns.get_loc("B"))
loc

2

In [73]:
len(df.columns)

3

In [74]:
df.insert(loc=len(df.columns), column='A', value=[7, 7, 7, 7, 7], allow_duplicates=True)
df

   A  A  B  A
0  5  1  3  7
1  6  2  4  7
2  2  3  2  7
3  3  3  4  7
4  4  4  5  7

In [75]:
df.insert(loc=int(df.columns.get_loc("B")), column='A', value=[97, 97, 97, 97, 97], allow_duplicates=True)
df

   A  A   A  B  A
0  5  1  97  3  7
1  6  2  97  4  7
2  2  3  97  2  7
3  3  3  97  4  7
4  4  4  97  5  7

#### Retornar o indice do nome de uma coluna

In [57]:
df.columns.get_loc("B"), type(df.columns.get_loc("B"))

(2, int)